Revit 2015 API
AnalyticalModel.GetAnalyticalProjectionDatumPlane Method
 Gets the datum plane for a given selector and direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. Analytical Projection has been divided into Projection and Extension. Use one of AnalyticalModelStick.GetProjectionPlaneY(), AnalyticalModelStick.GetProjectionPlaneZ() methods or AnalyticalModelColumn.BaseExtensionPlaneId, AnalyticalModelColumn.TopExtensionPlaneId, AnalyticalModelSurface.ProjectionPlaneZ, AnalyticalModelSurface.BottomExtensionPlaneId, AnalyticalModelSurface.TopExtensionPlaneId properties instead.")]
public ElementId GetAnalyticalProjectionDatumPlane(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. Analytical Projection has been divided into Projection and Extension. Use one of AnalyticalModelStick.GetProjectionPlaneY(), AnalyticalModelStick.GetProjectionPlaneZ() methods or AnalyticalModelColumn.BaseExtensionPlaneId, AnalyticalModelColumn.TopExtensionPlaneId, AnalyticalModelSurface.ProjectionPlaneZ, AnalyticalModelSurface.BottomExtensionPlaneId, AnalyticalModelSurface.TopExtensionPlaneId properties instead.")> _
Public Function GetAnalyticalProjectionDatumPlane ( _
	selector As AnalyticalElementSelector, _
	direction As AnalyticalDirection _
) As ElementId
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. Analytical Projection has been divided into Projection and Extension. Use one of AnalyticalModelStick.GetProjectionPlaneY(), AnalyticalModelStick.GetProjectionPlaneZ() methods or AnalyticalModelColumn.BaseExtensionPlaneId, AnalyticalModelColumn.TopExtensionPlaneId, AnalyticalModelSurface.ProjectionPlaneZ, AnalyticalModelSurface.BottomExtensionPlaneId, AnalyticalModelSurface.TopExtensionPlaneId properties instead.")]
public:
ElementId^ GetAnalyticalProjectionDatumPlane(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 End of the analytical model.
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction in which analytical model is projected.
Return Value
 Datum Plane on to which analytical model is projected, or invalidElementId if not projected to a Datum Plane.
Remarks
 Applicable for analytical models of linear elements (beams, braces, columns). This Datum Plane identifies a Level, a Grid, or a Ref Plane.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  direction is invalid for analytical model
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace